In [1]:
import pandas as pd
import numpy as np

Pandas is a powerful and open-source Python library. The Pandas library is used for data manipulation and analysis. Pandas consist of data structures and functions to perform efficient operations on data.
Pandas is a powerful and versatile library that simplifies the tasks of data manipulation in Python.

Pandas is well-suited for working with tabular data, such as spreadsheets or SQL tables.
The Pandas library is an essential tool for data analysts, scientists, and engineers working with structured data in Python.

In [2]:
# Playing with Dataframe
df=pd.DataFrame(np.arange(0,16).reshape(4,4),index=['Row1','Row2','Row3','Row4'],columns=['Column1','Column2','Column3','Column4'])

In [3]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15

In [4]:
df.to_excel('Test1.xlsx')

In [5]:
# Acessing the elements
# loc and iloc- index location(both index and column)
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
# row, column indexes
df.iloc[0:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15

In [8]:
type(df.iloc[0:,1:])

pandas.core.frame.DataFrame

In [9]:
# Converitng dataframe into arrays
df.iloc[0:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15]])

In [10]:
df.iloc[0:,1:].values.shape

(4, 3)

In [11]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [12]:
df.value_counts()

Column1  Column2  Column3  Column4
0        1        2        3          1
4        5        6        7          1
8        9        10       11         1
12       13       14       15         1
Name: count, dtype: int64

In [13]:
df['Column1'].value_counts()

Column1
0     1
4     1
8     1
12    1
Name: count, dtype: int64

In [14]:
df['Column2'].unique()

array([ 1,  5,  9, 13])

In [15]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13

In [16]:
df=pd.read_csv('mercedesbenz.csv')

In [17]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [19]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [20]:
df['X16'].value_counts()

X16
0    4198
1      11
Name: count, dtype: int64

In [21]:
df[df['y']>100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [22]:
from io import StringIO, BytesIO

In [23]:
data=('col1,col2,col3\n'
     'x,y,z\n'
     '1,2,3\n'
     '3,4,5')

In [24]:
type(data)

str

In [25]:
StringIO()

In [26]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    z
1    1    2    3
2    3    4    5

In [27]:
# Read from specific columns
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    1    2
2    3    4

In [28]:
data=('a,b,c\n'
     'x,y,z\n'
     '1,2,3\n'
     '3,4,5')

In [29]:
print(data)

a,b,c
x,y,z
1,2,3
3,4,5

In [30]:
df=pd.read_csv(StringIO(data),dtype=object)

In [31]:
df

   a  b  c
0  x  y  z
1  1  2  3
2  3  4  5

In [32]:
df['a'][1]

'1'

In [33]:
data=('a,b,c\n'
     '3,4,8\n'
     '1,2,3\n'
     '3,4,5')

In [34]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':object})

In [35]:
df

   a    b  c
0  3  4.0  8
1  1  2.0  3
2  3  4.0  5

In [36]:
data=('index,a,b,c\n'
     '3,apple,bat,5.7\n'
     '1,2,3,orange')

In [37]:
df=pd.read_csv(StringIO(data))

In [38]:
df

   index      a    b       c
0      3  apple  bat     5.7
1      1      2    3  orange

In [39]:
df=pd.read_csv(StringIO(data),index_col=0) 
# selecting which column should be my index, here i selected index=0
df

           a    b       c
index
3      apple  bat     5.7
1          2    3  orange

In [83]:
data=('index,a,b,c\n'
     '3,apple,bat,5.7\n'
     '1,2,3,orange')

In [85]:
pd.read_csv(StringIO(data),index_col=False)

   index      a    b       c
0      3  apple  bat     5.7
1      1      2    3  orange

In [99]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

     b       c
0  bat     5.7
1    3  orange

In [101]:
# Quoting Escape characters very useful in NLP
data='a,b\n"Hello,\\"Bob\\", nice to see you",5'

In [105]:
print(data)

a,b
"Hello,\"Bob\", nice to see you",5

In [107]:
pd.read_csv(StringIO(data),escapechar="\\")

                              a  b
0  Hello,"Bob", nice to see you  5

In [119]:
# URL TO CSV
# df=pd.read_csv('https://download.bls.gov/pub.time.series/cu/cu.item',delimiter='\t')